; ==========================================================
; ----------------------------------------------------------
; user_hotkeys.ahk  用户热键管理
;
; 作者: 烈焰
;
; 2019-02-07 00:44:35
; ----------------------------------------------------------
; ==========================================================


; ----------------------------------------------------------
; [针对av管理]360浏览器自定义修改av收藏
; ----------------------------------------------------------
^#a::write("#av女优# ★★★ ")               ; 输出"#av女优# ★★★ "

; 快速输入tags格式字符串
#+a::
    write(format("tags({1})", Av.get_tags格式("av女优", false)))
    send {left 1}
    ; 帮助提示
    show_msg(Av.get_tags格式("av女优", true),,8000)
    Return

^#+a::
    ; 帮助提示
    show_text(Av.get_tags格式("av女优", true))
    Return


^#z::write("#av作品# ★★★ ")               ; 输出"#av作品# ★★★ "

; 快速输入tags格式字符串
#+z::
    write(format("tags({1})", Av.get_tags格式("av作品", false)))
    send {left 1}
    ; 帮助提示
    show_msg(Av.get_tags格式("av作品", true), , 8000)
    Return

^#+z::
    ; 帮助提示
    show_text(Av.get_tags格式("av作品", true))
    Return

; ----------------------------------------------------------
; 常用快捷键
; ----------------------------------------------------------
:x*:@@@::write("lie_yan@126.com")             ; 输出邮箱

; 输出"评级星星"
:*:;xxxxx::★★★★★
:*:;5x::★★★★★
:*:;4x::★★★★☆
:*:;3x::★★★☆☆
:*:;2x::★★☆☆☆
:*:;1x::★☆☆☆☆
:*:;0x::☆☆☆☆☆

:x*:;id::                                ; 输出17位短id -- "14位时间+3位随机数" 下划线间隔
>!'::write(strId())

:x*:;now::                               ; 输出"日期时间字符串"
:x*:;nnn::
>!`;::write(Sys.now())

:x*:;date::                              ; 输出"日期字符串"
>!.::write(Sys.date())

:x*:;time::                              ; 输出"时间字符串"
>!/::write(Sys.time())

; ----------------------------------------------------------
; [测试] 模拟vim快捷键功能
; ----------------------------------------------------------
; 复制
:c*:;Y::
    write("这是大写的y")
Return
