; ==========================================================
; lib_其他内容.ahk
;
; 文档作者: tom
;
; 修改时间: 2019-05-15 02:23:56
; ==========================================================

; 十进制转二进制： ToBase(a,2)
; 十进制转十六进制： ToBase(a,16)
; 十进制转八进制： ToBase(a,8)
; 十进制转n进制： ToBase(a,n)
; 十六进制转n进制： ToBase(a,n) ,a为16进制数，以“0X”开头
 toBase(n,b){
    return (n < b ? "" : toBase(n//b,b)) . ((d:=Mod(n,b)) < 10 ? d : Chr(d+55))
}

; test toBase
; ----------------------------------------------------------
; msgbox, % toBase(15, 16)         ; f
; msgbox, % toBase(0x0000ff, 10)   ; 255
; ----------------------------------------------------------
